{
    "facts": [
        "Hitchcock's first film as a director was the comedy Mrs. Peabody (1922; also called Number 13), which was not completed, for lack of funding. His first released film was Always Tell Your Wife (1923), which he codirected with its star Seymour Hicks, but he did not receive credit",
        "In 1926 Hitchcock married his film editor and script supervisor, Alma Reville. The following year he made the melodrama Downhill, Easy Virtue (from a Noel Coward play), and the boxing drama The Ring, which was a critical success",
        "Hitchcock's first talking picture was the thriller Blackmail (1929)",
        "Murder! (1930) provided Hitchcock with another opportunity to explore cinematic suspense. Shot simultaneously in a German-language version (Mary, 1931), it stars Herbert Marshall as Sir John Menier, a gentleman knight and famed actor who turns amateur sleuth in order to save from the gallows an actress who has been convicted of murder.",
        "Hitchcock signed with Gaumont-British in 1934, and his first film for that company, The Man Who Knew Too Much (1934), was also his first international success.",
        "Gone with the Wind (1939) won the Academy Award for best picture, and Hitchcock earned his first Oscar nomination for best director.",
        "The screwball comedy Mr. and Mrs. Smith (1941) was Hitchcock's first change of pace since coming to Hollywood. The film starred Carole Lombard and Robert Montgomery as the eponymous bickerers who discover that their marriage is legally invalid. It was a box-office success but was Hitchcock's last comedy without any suspense elements.",
        "Suspicion (1941) seemed to promise a return to form. Fontaine played Lina, the timid wife of Johnnie (Cary Grant), a cad who may be trying to kill her. Hitchcock originally intended for the film to end with Lina's suicide. However, suicide was discouraged under the strictures of Hollywood's Production Code, which governed what could be depicted in movies, and the film ended with Lina's suspicions about Johnnie's character proving utterly groundless.",
        "After the commercial success of North by Northwest, Hitchcock made his most shocking movie, Psycho (1960). Critics were uncertain what to make of it; moviegoers, on the other hand, were immediately adored it.",
        "By the time Hitchcock made The Birds (1963) for Universal (which would release his last six films), the media had been trained to respond to his every signal. There were cover stories in national magazines and countless features extolling Hitchcock's latest blond discovery, model Tippi Hedren. The story itself—millions of birds settle in and finally attack the residents of a small town in coastal California—was based on a novelette by Daphne du Maurier; screenwriter Evan Hunter expanded it considerably to incorporate all sorts of Freudian byplay among social butterfly Melanie Daniels (Hedren); lawyer Mitch Brenner (Rod Taylor), her romantic interest; schoolteacher Annie Hayworth (Suzanne Pleshette), his former romantic interest; and icy Lydia Brenner (Jessica Tandy), Mitch's possessive mother. The Birds unfolds with a dream logic in which the birds are a punishment for Daniels.",
        "Hitchcock has been called by some the greatest of all directors, the most adroit, and the most admired, and the case has been made that he was all of these. His many classics are widely acknowledged—including The 39 Steps, The Lady Vanishes, Rebecca, Shadow of a Doubt, Notorious, Strangers on a Train, Rear Window, Vertigo, North by Northwest, Psycho, and The Birds",
        "Hitchcock's films usually center on either murder or espionage, with deception, mistaken identities, and chase sequences complicating and enlivening the plots.",
        "He was also a master of something he called the MacGuffin—that is, the use of an object or person who, for storytelling purposes, keeps the plot moving along even though that thing or person is not really central to the story. (Examples include the titular steps in Hitchcock's The 39 Steps and the microfilm in North by Northwest.)",
        "Hitchcock was knighted in 1980.",
        "Among the honors Hitchcock received are the Irving G. Thalberg Award from the Academy of Motion Picture Arts and Sciences (1968) and the Life Achievement Award from the American Film Institute (1979)."
    ]
}